---
kind: method
id: M:Autodesk.Revit.DB.View.CanCategoryBeHiddenTemporary(Autodesk.Revit.DB.ElementId)
zh: 视图
source: html/d6d5309a-4dfc-ead8-fc27-97b459111fb8.htm
---
# Autodesk.Revit.DB.View.CanCategoryBeHiddenTemporary Method

**中文**: 视图

Check if category can be temporarily hidden in the view.

## Syntax (C#)
```csharp
public bool CanCategoryBeHiddenTemporary(
	ElementId elementId
)
```

## Parameters
- **elementId** (`Autodesk.Revit.DB.ElementId`) - Id of the category to be checked

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null